{
    "displayName": "Android Enterprise High Data Protection v1.9",
    "description": "This app protection policy is for devices used by specific users or groups who are uniquely high risk (for example, users who handle highly sensitive data where unauthorized disclosure causes considerable material loss to the organization).",
    "roleScopeTagIds": [
        "0"
    ],
    "periodOfflineBeforeAccessCheck": "PT12H",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "allowedInboundDataTransferSources": "managedApps",
    "allowedOutboundDataTransferDestinations": "managedApps",
    "organizationalCredentialsRequired": false,
    "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
    "dataBackupBlocked": true,
    "deviceComplianceRequired": true,
    "managedBrowserToOpenLinksRequired": true,
    "saveAsBlocked": true,
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "pinRequired": true,
    "maximumPinRetries": 5,
    "simplePinBlocked": true,
    "minimumPinLength": 6,
    "pinCharacterSet": "numeric",
    "periodBeforePinReset": "P365D",
    "allowedDataStorageLocations": [
        "oneDriveForBusiness",
        "sharePoint"
    ],
    "contactSyncBlocked": false,
    "printBlocked": true,
    "fingerprintBlocked": false,
    "disableAppPinIfDevicePinIsSet": false,
    "maximumRequiredOsVersion": "11.0",
    "maximumWarningOsVersion": null,
    "maximumWipeOsVersion": null,
    "minimumRequiredOsVersion": "9.0",
    "minimumWarningOsVersion": null,
    "minimumRequiredAppVersion": null,
    "minimumWarningAppVersion": null,
    "minimumWipeOsVersion": null,
    "minimumWipeAppVersion": null,
    "appActionIfDeviceComplianceRequired": "wipe",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "pinRequiredInsteadOfBiometricTimeout": "PT12H",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "notificationRestriction": "blockOrganizationalData",
    "previousPinBlockCount": 0,
    "managedBrowser": "microsoftEdge",
    "maximumAllowedDeviceThreatLevel": "secured",
    "mobileThreatDefenseRemediationAction": "block",
    "blockDataIngestionIntoOrganizationDocuments": true,
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint"
    ],
    "appActionIfUnableToAuthenticateUser": "block",
    "dialerRestrictionLevel": "managedApps",
    "isAssigned": false,
    "targetedAppManagementLevels": "unspecified",
    "appGroupType": "allCoreMicrosoftApps",
    "screenCaptureBlocked": true,
    "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
    "encryptAppData": true,
    "minimumRequiredPatchVersion": "0000-00-00",
    "minimumWarningPatchVersion": "0000-00-00",
    "minimumWipePatchVersion": "0000-00-00",
    "allowedAndroidDeviceManufacturers": null,
    "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
    "requiredAndroidSafetyNetDeviceAttestationType": "basicIntegrityAndDeviceCertification",
    "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
    "requiredAndroidSafetyNetAppsVerificationType": "enabled",
    "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
    "customBrowserPackageId": "",
    "customBrowserDisplayName": "",
    "minimumRequiredCompanyPortalVersion": null,
    "minimumWarningCompanyPortalVersion": null,
    "minimumWipeCompanyPortalVersion": null,
    "keyboardsRestricted": true,
    "allowedAndroidDeviceModels": [],
    "appActionIfAndroidDeviceModelNotAllowed": "block",
    "customDialerAppPackageId": "",
    "customDialerAppDisplayName": "",
    "biometricAuthenticationBlocked": false,
    "requiredAndroidSafetyNetEvaluationType": "hardwareBacked",
    "blockAfterCompanyPortalUpdateDeferralInDays": 0,
    "warnAfterCompanyPortalUpdateDeferralInDays": 0,
    "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
    "deviceLockRequired": true,
    "appActionIfDeviceLockNotSet": "block",
    "connectToVpnOnLaunch": false,
    "exemptedAppPackages": [],
    "approvedKeyboards": [
        {
            "name": "com.google.android.inputmethod.latin",
            "value": "Gboard - the Google Keyboard"
        },
        {
            "name": "com.touchtype.swiftkey",
            "value": "SwiftKey Keyboard"
        },
        {
            "name": "com.sec.android.inputmethod",
            "value": "Samsung Keyboard"
        },
        {
            "name": "com.google.android.apps.inputmethod.hindi",
            "value": "Google Indic Keyboard"
        },
        {
            "name": "com.google.android.inputmethod.pinyin",
            "value": "Google Pinyin Input"
        },
        {
            "name": "com.google.android.inputmethod.japanese",
            "value": "Google Japanese Input"
        },
        {
            "name": "com.google.android.inputmethod.korean",
            "value": "Google Korean Input"
        },
        {
            "name": "com.google.android.apps.handwriting.ime",
            "value": "Google Handwriting Input"
        },
        {
            "name": "com.google.android.googlequicksearchbox",
            "value": "Google voice typing"
        },
        {
            "name": "com.samsung.android.svoiceime",
            "value": "Samsung voice input"
        },
        {
            "name": "com.samsung.android.honeyboard",
            "value": "Samsung Keyboard"
        }
    ],
    "@odata.type": "#microsoft.graph.androidManagedAppProtection"
}