{
    "displayName": "iOS/iPadOS Enterprise High Data Protection v1.5",
    "description": "This app protection policy is for devices used by specific users or groups who are uniquely high risk (for example, users who handle highly sensitive data where unauthorized disclosure causes considerable material loss to the organization).",
    "roleScopeTagIds": [
        "0"
    ],
    "periodOfflineBeforeAccessCheck": "PT12H",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "allowedInboundDataTransferSources": "managedApps",
    "allowedOutboundDataTransferDestinations": "managedApps",
    "organizationalCredentialsRequired": false,
    "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
    "dataBackupBlocked": true,
    "deviceComplianceRequired": true,
    "managedBrowserToOpenLinksRequired": true,
    "saveAsBlocked": true,
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "pinRequired": true,
    "maximumPinRetries": 5,
    "simplePinBlocked": true,
    "minimumPinLength": 6,
    "pinCharacterSet": "numeric",
    "periodBeforePinReset": "P365D",
    "allowedDataStorageLocations": [
        "oneDriveForBusiness",
        "sharePoint"
    ],
    "contactSyncBlocked": false,
    "printBlocked": true,
    "fingerprintBlocked": false,
    "disableAppPinIfDevicePinIsSet": false,
    "maximumRequiredOsVersion": "15.0",
    "maximumWarningOsVersion": null,
    "maximumWipeOsVersion": null,
    "minimumRequiredOsVersion": "14.8",
    "minimumWarningOsVersion": null,
    "minimumRequiredAppVersion": null,
    "minimumWarningAppVersion": null,
    "minimumWipeOsVersion": null,
    "minimumWipeAppVersion": null,
    "appActionIfDeviceComplianceRequired": "wipe",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "pinRequiredInsteadOfBiometricTimeout": "PT12H",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "notificationRestriction": "blockOrganizationalData",
    "previousPinBlockCount": 0,
    "managedBrowser": "microsoftEdge",
    "maximumAllowedDeviceThreatLevel": "secured",
    "mobileThreatDefenseRemediationAction": "block",
    "blockDataIngestionIntoOrganizationDocuments": true,
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint"
    ],
    "appActionIfUnableToAuthenticateUser": "block",
    "dialerRestrictionLevel": "customApp",
    "isAssigned": false,
    "targetedAppManagementLevels": "unspecified",
    "appGroupType": "allCoreMicrosoftApps",
    "appDataEncryptionType": "whenDeviceLocked",
    "minimumRequiredSdkVersion": null,
    "faceIdBlocked": false,
    "minimumWipeSdkVersion": null,
    "allowedIosDeviceModels": null,
    "appActionIfIosDeviceModelNotAllowed": "block",
    "thirdPartyKeyboardsBlocked": true,
    "filterOpenInToOnlyManagedApps": false,
    "disableProtectionOfManagedOutboundOpenInData": false,
    "protectInboundDataFromUnknownSources": false,
    "customBrowserProtocol": "",
    "customDialerAppProtocol": "replace_with_dialer_app_url_scheme",
    "exemptedAppProtocols": [
        {
            "name": "Default",
            "value": "tel;telprompt;skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
        }
    ],
    "@odata.type": "#microsoft.graph.iosManagedAppProtection"
}