{
    "displayName": "Android Enterprise Enhanced Data Protection v1.9",
    "description": "This app protection policy introduces data leakage prevention mechanisms and minimum OS requirements. This is the configuration that is applicable to most mobile users accessing work or school data.",
    "roleScopeTagIds": [
        "0"
    ],
    "periodOfflineBeforeAccessCheck": "PT12H",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "allowedInboundDataTransferSources": "allApps",
    "allowedOutboundDataTransferDestinations": "managedApps",
    "organizationalCredentialsRequired": false,
    "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
    "dataBackupBlocked": true,
    "deviceComplianceRequired": true,
    "managedBrowserToOpenLinksRequired": true,
    "saveAsBlocked": true,
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "pinRequired": true,
    "maximumPinRetries": 5,
    "simplePinBlocked": false,
    "minimumPinLength": 4,
    "pinCharacterSet": "numeric",
    "periodBeforePinReset": "PT0S",
    "allowedDataStorageLocations": [
        "oneDriveForBusiness",
        "sharePoint"
    ],
    "contactSyncBlocked": false,
    "printBlocked": false,
    "fingerprintBlocked": false,
    "disableAppPinIfDevicePinIsSet": false,
    "maximumRequiredOsVersion": null,
    "maximumWarningOsVersion": null,
    "maximumWipeOsVersion": null,
    "minimumRequiredOsVersion": "9.0",
    "minimumWarningOsVersion": null,
    "minimumRequiredAppVersion": null,
    "minimumWarningAppVersion": null,
    "minimumWipeOsVersion": null,
    "minimumWipeAppVersion": null,
    "appActionIfDeviceComplianceRequired": "block",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "pinRequiredInsteadOfBiometricTimeout": "PT12H",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "notificationRestriction": "blockOrganizationalData",
    "previousPinBlockCount": 0,
    "managedBrowser": "microsoftEdge",
    "maximumAllowedDeviceThreatLevel": "notConfigured",
    "mobileThreatDefenseRemediationAction": "block",
    "blockDataIngestionIntoOrganizationDocuments": false,
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint",
        "camera"
    ],
    "appActionIfUnableToAuthenticateUser": "block",
    "dialerRestrictionLevel": "allApps",
    "isAssigned": false,
    "targetedAppManagementLevels": "unspecified",
    "appGroupType": "allCoreMicrosoftApps",
    "screenCaptureBlocked": true,
    "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
    "encryptAppData": true,
    "minimumRequiredPatchVersion": null,
    "minimumWarningPatchVersion": null,
    "minimumWipePatchVersion": null,
    "allowedAndroidDeviceManufacturers": null,
    "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
    "requiredAndroidSafetyNetDeviceAttestationType": "basicIntegrityAndDeviceCertification",
    "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
    "requiredAndroidSafetyNetAppsVerificationType": "enabled",
    "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
    "customBrowserPackageId": "",
    "customBrowserDisplayName": "",
    "minimumRequiredCompanyPortalVersion": null,
    "minimumWarningCompanyPortalVersion": null,
    "minimumWipeCompanyPortalVersion": null,
    "keyboardsRestricted": false,
    "allowedAndroidDeviceModels": [],
    "appActionIfAndroidDeviceModelNotAllowed": "block",
    "customDialerAppPackageId": null,
    "customDialerAppDisplayName": null,
    "biometricAuthenticationBlocked": true,
    "requiredAndroidSafetyNetEvaluationType": "hardwareBacked",
    "blockAfterCompanyPortalUpdateDeferralInDays": 0,
    "warnAfterCompanyPortalUpdateDeferralInDays": 0,
    "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
    "deviceLockRequired": true,
    "appActionIfDeviceLockNotSet": "block",
    "connectToVpnOnLaunch": false,
    "exemptedAppPackages": [],
    "approvedKeyboards": [],
    "@odata.type": "#microsoft.graph.androidManagedAppProtection"
}