{
    "displayName": "iOS/iPadOS Enterprise Enhanced Data Protection v1.5",
    "description": "This app protection policy introduces data leakage prevention mechanisms and minimum OS requirements. This is the configuration that is applicable to most mobile users accessing work or school data.",
    "roleScopeTagIds": [
        "0"
    ],
    "periodOfflineBeforeAccessCheck": "PT12H",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "allowedInboundDataTransferSources": "allApps",
    "allowedOutboundDataTransferDestinations": "managedApps",
    "organizationalCredentialsRequired": false,
    "allowedOutboundClipboardSharingLevel": "managedAppsWithPasteIn",
    "dataBackupBlocked": true,
    "deviceComplianceRequired": true,
    "managedBrowserToOpenLinksRequired": true,
    "saveAsBlocked": true,
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "pinRequired": true,
    "maximumPinRetries": 5,
    "simplePinBlocked": false,
    "minimumPinLength": 4,
    "pinCharacterSet": "numeric",
    "periodBeforePinReset": "PT0S",
    "allowedDataStorageLocations": [
        "oneDriveForBusiness",
        "sharePoint"
    ],
    "contactSyncBlocked": false,
    "printBlocked": false,
    "fingerprintBlocked": false,
    "disableAppPinIfDevicePinIsSet": false,
    "maximumRequiredOsVersion": null,
    "maximumWarningOsVersion": null,
    "maximumWipeOsVersion": null,
    "minimumRequiredOsVersion": "14.8",
    "minimumWarningOsVersion": null,
    "minimumRequiredAppVersion": null,
    "minimumWarningAppVersion": null,
    "minimumWipeOsVersion": null,
    "minimumWipeAppVersion": null,
    "appActionIfDeviceComplianceRequired": "block",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "pinRequiredInsteadOfBiometricTimeout": "PT12H",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "notificationRestriction": "blockOrganizationalData",
    "previousPinBlockCount": 0,
    "managedBrowser": "microsoftEdge",
    "maximumAllowedDeviceThreatLevel": "notConfigured",
    "mobileThreatDefenseRemediationAction": "block",
    "blockDataIngestionIntoOrganizationDocuments": false,
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint",
        "camera"
    ],
    "appActionIfUnableToAuthenticateUser": "block",
    "dialerRestrictionLevel": "allApps",
    "isAssigned": false,
    "targetedAppManagementLevels": "unspecified",
    "appGroupType": "allCoreMicrosoftApps",
    "appDataEncryptionType": "whenDeviceLocked",
    "minimumRequiredSdkVersion": null,
    "faceIdBlocked": false,
    "minimumWipeSdkVersion": null,
    "allowedIosDeviceModels": null,
    "appActionIfIosDeviceModelNotAllowed": "block",
    "thirdPartyKeyboardsBlocked": false,
    "filterOpenInToOnlyManagedApps": false,
    "disableProtectionOfManagedOutboundOpenInData": false,
    "protectInboundDataFromUnknownSources": false,
    "customBrowserProtocol": "",
    "customDialerAppProtocol": null,
    "exemptedAppProtocols": [
        {
            "name": "Default",
            "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
        }
    ],
    "@odata.type": "#microsoft.graph.iosManagedAppProtection"
}