{
    "displayName": "Android Enterprise Basic Data Protection v1.7",
    "description": "This app protection policy ensures that apps with work or school account data are protected with a PIN, encrypted, validates Android device attestation, and enables selective wipe operations.",
    "roleScopeTagIds": [
        "0"
    ],
    "periodOfflineBeforeAccessCheck": "PT12H",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "allowedInboundDataTransferSources": "allApps",
    "allowedOutboundDataTransferDestinations": "allApps",
    "organizationalCredentialsRequired": false,
    "allowedOutboundClipboardSharingLevel": "allApps",
    "dataBackupBlocked": false,
    "deviceComplianceRequired": true,
    "managedBrowserToOpenLinksRequired": false,
    "saveAsBlocked": false,
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "pinRequired": true,
    "maximumPinRetries": 5,
    "simplePinBlocked": false,
    "minimumPinLength": 4,
    "pinCharacterSet": "numeric",
    "periodBeforePinReset": "PT0S",
    "allowedDataStorageLocations": [],
    "contactSyncBlocked": false,
    "printBlocked": false,
    "fingerprintBlocked": false,
    "disableAppPinIfDevicePinIsSet": false,
    "maximumRequiredOsVersion": null,
    "maximumWarningOsVersion": null,
    "maximumWipeOsVersion": null,
    "minimumRequiredOsVersion": null,
    "minimumWarningOsVersion": null,
    "minimumRequiredAppVersion": null,
    "minimumWarningAppVersion": null,
    "minimumWipeOsVersion": null,
    "minimumWipeAppVersion": null,
    "appActionIfDeviceComplianceRequired": "block",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "pinRequiredInsteadOfBiometricTimeout": "PT12H",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "notificationRestriction": "allow",
    "previousPinBlockCount": 0,
    "managedBrowser": "notConfigured",
    "maximumAllowedDeviceThreatLevel": "notConfigured",
    "mobileThreatDefenseRemediationAction": "block",
    "blockDataIngestionIntoOrganizationDocuments": false,
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint",
        "camera"
    ],
    "appActionIfUnableToAuthenticateUser": null,
    "dialerRestrictionLevel": "allApps",
    "isAssigned": false,
    "targetedAppManagementLevels": "unspecified",
    "appGroupType": "allCoreMicrosoftApps",
    "screenCaptureBlocked": false,
    "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
    "encryptAppData": true,
    "minimumRequiredPatchVersion": "0000-00-00",
    "minimumWarningPatchVersion": "0000-00-00",
    "minimumWipePatchVersion": "0000-00-00",
    "allowedAndroidDeviceManufacturers": null,
    "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
    "requiredAndroidSafetyNetDeviceAttestationType": "basicIntegrityAndDeviceCertification",
    "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
    "requiredAndroidSafetyNetAppsVerificationType": "enabled",
    "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
    "customBrowserPackageId": "",
    "customBrowserDisplayName": "",
    "minimumRequiredCompanyPortalVersion": null,
    "minimumWarningCompanyPortalVersion": null,
    "minimumWipeCompanyPortalVersion": null,
    "keyboardsRestricted": false,
    "allowedAndroidDeviceModels": [],
    "appActionIfAndroidDeviceModelNotAllowed": "block",
    "customDialerAppPackageId": null,
    "customDialerAppDisplayName": null,
    "biometricAuthenticationBlocked": false,
    "requiredAndroidSafetyNetEvaluationType": "basic",
    "blockAfterCompanyPortalUpdateDeferralInDays": 0,
    "warnAfterCompanyPortalUpdateDeferralInDays": 0,
    "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
    "deviceLockRequired": true,
    "appActionIfDeviceLockNotSet": "block",
    "connectToVpnOnLaunch": false,
    "exemptedAppPackages": [],
    "approvedKeyboards": [],
    "@odata.type": "#microsoft.graph.androidManagedAppProtection"
}